//app.js
App({
  onLaunch: function () {
    //调用API从本地缓存中获取数据
    var logs = wx.getStorageSync('logs') || []
    var detail = wx.getStorageSync('detail') || {}
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)
  },
  getUserInfo:function(cb){
    var that = this;
    if(this.globalData.userInfo){
      typeof cb == "function" && cb(this.globalData.userInfo)
    }else{
      //调用登录接口
      wx.login({
        success: function () {
          wx.getUserInfo({
            success: function (res) {
              that.globalData.userInfo = res.userInfo;
              typeof cb == "function" && cb(that.globalData.userInfo)
            }
          })
        }
      });
    }
  },
  globalData:{
    heroes:[{
        "name":"宋江",
        "title":"总兵都头领",
        "des":"及时雨、呼保义",
        "photo":"http://images.missyuan.com/attachments/day_090414/20090414_8612c24803208db15527Gb0OBG0lW7iv.jpg",
        "content":"宋江（1091~1124），字公明，施耐庵所作古典名著《水浒传》中的第一号人物，为梁山起义军领袖。宋江在一百单八将稳坐梁山泊第一把交椅，为三十六天罡星之首的天魁星。绰号呼保义，为人急公好义，常救人于危难时刻所以又号及时雨，人称孝义黑三郎。身材矮小，面目黝黑。原为山东郓城县押司，后因私放晁盖等人，被阎婆惜捉住把柄，以至于杀了阎婆惜后连夜逃走，辗转周折上了梁山。晁盖死后继任梁山大寨主，主张并接受朝廷的招安，接连出征辽国、田虎、王庆、方腊等，屡立战功，最后被高俅等奸臣设计用毒酒害死。"
        },{
            "name":"卢俊义",
            "title":"总兵都头领",
            "des":"玉麒麟",
            "photo":"http://images.missyuan.com/attachments/day_090414/20090414_f98849f1416957148772M39vp0Vmz3sm.jpg",
            "content":"卢俊义是中国著名古典小说《水浒传》中的经典人物形象之一，绰号——玉麒麟，武艺高强，棍棒天下无双，江湖人称——河北三绝，祖居北京大名府（今河北省邯郸市大名县），有妻子贾氏、管家李固、仆人燕青。原本是河北大名府富商、大财主、员外，被吴用等人利用李固与贾氏的奸情，使计赚上梁山，后来成为梁山第二首领。卢俊义和宋江一同受招安后，征讨了辽国、田虎、王庆、方腊，官至武功大夫、卢州安抚使。蔡京等奸臣传召卢俊义回京，把水银放在皇帝赐给他的饭菜中，卢俊义痛得无法骑马，只好坐船回庐州，途中失足落水溺死。 在《说岳全传》中，卢俊义是周侗的徒弟，与林冲、岳飞是师兄弟，这种说法流传极广。而后世的大量评书等衍生文学作品中，又加入了史文恭是卢俊义师兄弟的说法。 "
        },{
            "name":"吴用",
            "title":"掌管机密军师",
            "des":"智多星",
            "photo":"http://images.missyuan.com/attachments/day_090414/20090414_4a21edfd9a9e4d5b943424FcQU6354Q6.jpg",
            "content":"吴用，小说《水浒传》中的主要人物，梁山泊排名第三，上应天机星，山东菏泽市郓城县东溪村人。吴用满腹经纶，通晓文韬武略，足智多谋，常以诸葛亮自比，道号“加亮先生”，人称\"智多星\"。在财主家任门馆教授，生得眉清目秀，面白须长，善使两条铜链，与晁盖自幼结交，与晁盖等人智取了大名府梁中书给蔡京献寿的十万贯生辰纲，为避免官府追缉而上梁山， 为山寨的掌管机密军师。梁山几乎所有的军事行动都是由他一手策划，是梁山起义军中的知识分子的代表，梁山起义军的军师，基层人民智慧的化身。受招安后，因宋江被害后托梦给他，与花荣一同自缢于楚州南门外蓼儿洼宋江墓前，尸身葬于宋江墓左侧。"
        },{
            "name":"公孙胜",
            "title":"掌管机密军师",
            "des":"入云龙",
            "photo":"http://images.missyuan.com/attachments/day_090414/20090414_3ffb5c48182ce8f7117egkz57jj7355G.jpg",
            "content":"公孙胜是《水浒传》中的人物，绰号入云龙，道号一清，蓟州人氏。他与晁盖、吴用等七人结义，一同劫取生辰纲，后上梁山入伙。后离开梁山，回乡探母，直到大破高唐州时方被戴宗请回。梁山大聚义时，排第四位，上应天闲星，担任掌管机密军师。征方腊前返回蓟州，潜心修道。"
        },{
            "name":"关胜",
            "title":"马军五虎将、左军大将",
            "des":"大刀",
            "photo":"http://images.missyuan.com/attachments/day_090414/20090414_71eb7b4e9c85904fe8c07oR7d8RXM2OR.jpg",
            "content":"关胜是《水浒传》中的人物，绰号大刀，在梁山好汉中排名第五，位居马军五虎将第一位，河东解良（今山西运城）人，是三国名将关羽的后代，精通兵法，使一把青龙偃月刀。他原是蒲东巡检，因梁山攻打北京，被宣赞推荐给蔡京，领兵攻打梁山以解北京之围。关胜一人大战林冲、秦明两人，在即将落败之时，宋江怕关胜战亡叫停。呼延灼用假投降的办法引关胜兵马进入宋江的大寨，被挠挂钩拖下马鞍活捉。关胜感到宋江有胆识重义气，便归顺了梁山。蔡京调兵进攻梁山，关胜杀败单廷珪，单廷珪便投降了梁山。受招安征讨辽国、田虎、王庆、方腊后，关胜被封为大名府正兵马总管。一天，操练军队之后回家，喝醉了而堕马，因而得了重病，不久不愈而病死。"
        },{
            "name":"林冲",
            "title":"马军五虎将、右军大将",
            "des":"豹子头",
            "photo":"http://images.missyuan.com/attachments/day_090414/20090414_0de8f1da5efc111b7856I157FKFiplFP.jpg",
            "content":"林冲是中国古典小说《水浒传》中的重要人物之一，外号豹子头，是东京八十万禁军教头，妻子是张氏贞娘，岳父也是禁军教头，操刀鬼曹正是他的徒弟。因其妻被太尉高俅的养子高衙内看上，而多次被陷害，最后走投无路，只能在柴进的推荐下，上了梁山落草。但梁山寨主王伦不能容他，林冲心中郁闷。直至晁盖等人上梁山，在吴用的诱使下，林冲火并王伦，并尊晁盖为寨主。上山后，林冲惯使丈八蛇矛；梁山泊排座次时，为山寨马军五虎将中排名第二，镇守正西旱寨。林冲为梁山打了许多胜仗，立功很多；受招安后，随宋江、卢俊义征讨辽国、田虎、王庆；征方腊时，在杭州染了风瘫，留在六和寺养病，由武松照顾，半载后病故，追封忠武郎。他的事迹《误入白虎堂》、《棒打洪教头》、《风雪山神庙》等通过评书、戏曲等方式在民间广为流传，在扬州评话中有单独的《林十回》，由著名评话大师王少堂整理出版。"
        },{
            "name":"秦明",
            "title":"马军五虎将、先锋大将",
            "des":"霹雳火",
            "photo":"http://images.missyuan.com/attachments/day_090414/20090414_313668b82216b0f8b9760b4BB6vX5wsb.jpg",
            "content":"秦明是古典小说《水浒传》中的人物，一百单八将之一。因其性如烈火，故而人称“霹雳火”。祖籍山后开州。善使一条狼牙棒。本是青州指挥司统制，攻打清风山时，因中宋江的计策，被俘后无家可归，只得归顺。自上梁山后，秦明凭手中狼牙棒，在一系列战斗中屡立战功。大聚义排座次时，在梁山排行第7位，上应“天猛星”。又被封为“马军五虎将”第3位。梁山受招安后，随宋江征讨辽国、王庆、田虎、方腊，多建功勋。在征讨方腊时，与方腊之侄方杰大战，后因急躲暗器，被方杰一戟耸于马下，死于非命。"
        },{
            "name":"呼延灼",
            "title":"马军五虎将、合后大将",
            "des":"双鞭",
            "photo":"http://b.hiphotos.baidu.com/baike/w%3D268%3Bg%3D0/sign=3151066c57e736d158138b0ea36b28ff/728da9773912b31b390e85998518367adab4e124.jpg",
            "content":"呼延灼是小说《水浒传》中的人物，宋朝开国名将铁鞭王呼延赞嫡派子孙，祖籍并州太原（今属山西太原），上梁山之前为汝宁郡都统制，武艺高强，杀伐骁勇，有万夫不当之勇。因其善使两条水磨八棱钢鞭，故人称“双鞭”呼延灼。在梁山排座次时，坐第八把交椅。呼延灼位列天罡星第八位，上应“天威星”，为梁山第八名好汉，又被封为“马军五虎将”之第四员。梁山受招安后，随宋江征讨辽国、王庆、田虎、方腊，多建功勋。班师回朝后，呼延灼被封为御营兵马指挥使。后来率领大军，打败了金兀术四太子，大军一直杀至淮西，呼延灼阵亡。"
        }]
  }
})
