var res = [
{
"title": "Spotify正扼杀你的SSD寿命 1小时写入5到10GB数据",
"href": "http://m.cnbeta.com/view/557707.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/fabfc28ded93b2b.jpg_600x600.jpg",
"summary": "摘要：Spotify是广受欢迎的音乐流媒体服务，但同时它也是固态硬盘寿命的“杀手”--通过大数据的重复写入大幅降低SSD的寿命，甚至于该项服务处于闲置状态也能产生严重的负面影响。这个问题将会通过更新的方式得到修复，不过Ars  Technica表示该问题不可能迅速解决。"
},
{
"title": "快递包装五花大绑 人民日报:离绿色化还有多远?",
"href": "http://m.cnbeta.com/view/557705.htm",
"summary": "摘要：目前，快递包装过度、循环利用率低等现象普遍存在，给环境带来沉重负担。推进快递包装绿色化，从国家层面到相关企业都已开始行动，采取了研发可降解材料、促进包装循环利用等措施。不过，包装标准滞后、回收循环较难、环保意识不足，仍是三大瓶颈。绿色包装破局，有待政府、企业、消费者形成强大合力。"
},
{
"title": "马云问过贝克汉姆一个中国人很关心的问题",
"href": "http://m.cnbeta.com/view/557703.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/e9f7326bcc2509d.jpg",
"summary": "摘要：在11月13日晚央视财经《对话》中，国际球星贝克汉姆在采访中谈及同马云的一次谈话。《对话》主持人问贝克汉姆“2014年我在采访马云的时候，他说几天前我刚刚见了贝克汉姆，我很好奇你们俩之间的谈话究竟会聚焦在什么方面”。"
},
{
"title": "聚焦双11快递：如此繁忙 快递员会暴力分拣吗？",
"href": "http://m.cnbeta.com/view/557701.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/a276d467e7c03e2.jpg_600x600.jpg",
"summary": "摘要：今年“双十一”掀起的购物狂欢，再次刷爆快递业的业务量。国家邮政局11月12日发布监测数据显示，11月11日全国各邮政、快递企业共处理快件2.51亿件，同比增长52%；全国主要电商企业共产生快递物流订单3.5亿件，同比增长59%。在如此之大的业务量面前，快递行业屡受诟病的“老毛病”是否会再犯？"
},
{
"title": "中国“土豪金”标准动车组即将量产：性能超日本新干线",
"href": "http://m.cnbeta.com/view/557699.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/2d98abbe8335b63.png",
"summary": "摘要：最近两个月，有些细心的高铁乘客已经发现，在沈大铁路线上行驶着一辆有着“土豪金”颜色车头的新型高铁列车，它就是由中车长客股份公司研制的CRH-0503号中国标准动车组。日前，经过两个多月的载客运营，“长客造”中国标准动车组正式通过60万公里考核，即将进入批量生产阶段。"
},
{
"title": "[图]21岁男子为Facebook上吸引关注度而放山火",
"href": "http://m.cnbeta.com/view/557697.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/43e15f75467618a.jpeg_600x600.jpeg",
"summary": "摘要：美联社报道，美国肯塔基州詹金斯的警局局长本周五James  Stephens表示一名21岁的天气预报员Johnny  Mullins因为想要获得更高的Facebook点击而采取了比较极端的方式--放山火。Stephens说道：“Mullins非常热衷于制作Facebook以便于让更多人关注他的‘天气预报’。所以这是他为何要这么做（放山火）的原因。他非常享受Facebook用户关注的感觉。”"
},
{
"title": "魅蓝Note 5新机现身：Helio P10+3G内存",
"href": "http://m.cnbeta.com/view/557695.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/1f79644b247210c.jpg_600x600.jpg",
"summary": "摘要：魅族年底前还会有演唱会吗？这事儿还真不好说。在GeekBench数据库出现了一款魅族新机，型号显示为Meizu  M5  Note，魅蓝Note  5的可能性最大。该机搭载联发科MT6755M处理器（Helio  P10），3GB  RAM，Android  6.0系统，单核跑分687，多核跑分2481分。从魅蓝5来看，魅族跳过4直接发魅蓝Note  5是有可能的，而且配置的确符合魅族目前的产品线策略。"
},
{
"title": "扎克伯格回应Facebook假新闻助特朗普当选：没有的事儿",
"href": "http://m.cnbeta.com/view/557693.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/7d52d7ced046826.png",
"summary": "摘要：Facebook  CEO马克·扎克伯格(Mark  Zuckerberg)上周末发表文章，回应了外界对于Facebook影响美国大选的批评。不论是特朗普胜选前，还是胜选后，Facebook都被指责促进了虚假或误导性新闻以及其它内容的传播。"
},
{
"title": "成人约会公司FriendFinder Network有4.12亿用户帐号信息被窃",
"href": "http://m.cnbeta.com/view/557691.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/18933f0946e0387.jpg_600x600.jpg",
"summary": "摘要：援引数据被窃监控服务LeakedSource报道，成人约会和娱乐公司FriendFinder  Network旗下4.12亿用户帐号信息被曝光。在上周日披露的信息中，黑客成功从FriendFinder旗下的6家成人网站中收集了近20年来的用户邮件地址和密码，其中被公司称之为“全球最大的色情和时尚社区”--AdultFriendFinder.com网站共有3.39亿用户信息被窃。"
},
{
"title": "被免去董事长职务之后 董明珠在格力还能走多远？",
"href": "http://m.cnbeta.com/view/557689.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/0f4f74b8ef3a32e.jpg",
"summary": "摘要：被业界赋予家电女皇和格力灵魂人物之称的董明珠又遇上了麻烦。上周五，珠海市国资委的证实，董明珠已于10月下旬被免去了格力集团董事长的职务。格力官方表示，董总基于国家的相关规定及本人意愿，主动辞去格力集团董事长一职，仍继续担任格力电器的董事长兼总裁，专注于推动格力电器的发展。"
},
{
"title": "[图]Nextbit云手机Robin刷新历史低价至169.99美元",
"href": "http://m.cnbeta.com/view/557687.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/816e87a41091bb8.jpg_600x600.jpg",
"summary": "摘要：瞄准日趋成熟的云技术，由HTC前设计主管和谷歌前高管组成的新创公司Nextbit在1年前推出了“以云端为先”的Robin手机，以云存储为后盾带来了接近于无限容量的使用体验。该机最初在Kickstarter上众筹的价格为299美元，正式上架发售的价格为349美元，而现在这款设备在亚马逊上折扣售价至169.99美元。"
},
{
"title": "家电制造成本上升 涨价压力传导下游",
"href": "http://m.cnbeta.com/view/557685.htm",
"summary": "摘要：“由于钢材、玻璃等原料价格持续上涨，导致成本持续增加，本公司每款产品价格上调20元/台，上调时间从2016年11月1日执行。”“因近期原材料价格集体上涨（特别是钢材和发泡料涨幅40%以上），而且还有进一步上涨趋势。公司从2016年10月1日起所有订单每台上调15元。”日前，佛山、中山等地一些中小家电企业开始对渠道经销商发出调价通知，国内多地家电生产企业也均反映出成本激增问题。在国内消费持续低迷的背景下，部分家电企业难以负荷成本压力，开始向下游传导。"
},
{
"title": "新标准 - 中国原创方案突破白血病世界性难题",
"href": "http://m.cnbeta.com/view/557683.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/84d7bd7e777ecb9.jpg",
"summary": "摘要：11月13日，中国医学团队的原创方案成功突破了白血病骨髓移植供体不足的世界性难题，成为全球一半以上单倍体骨髓移植5患者的首选方案。13日在京闭幕的第七届亚洲细胞治疗组织年会上，与会各国专家肯定了该方案对全球作出的贡献。作为一种恶性血液疾病，白血病的死亡率占儿童恶性疾病死亡率的第一位、成人恶性疾病死亡率的第六位。治疗该病的最有效方法是进行造血干细胞移植即骨髓移植。然而，骨髓移植须在人类白细胞抗原（HLA）100%全相合的情况下进行，否则极易发生严重排异反应。"
},
{
"title": "走出“半块钱”怪圈 中国快递在路上",
"href": "http://m.cnbeta.com/view/557681.htm",
"summary": "摘要：“电商一个节，物流一个坎。”这是快递行业内部的一个戏称。近年来，在电商飞速发展的行业背景下，每年电商购物节，都成为快递物流的“春运”大考。2016年的“双十一”同样如此，甚至相较于往年，今年的峰值压力可能更为巨大。国家邮政局副局长刘君11月9日表示，2016年“双十一”快递业务量或将再次刷新包裹数量纪录，超过10亿件，按年增35%；预计最高日处理量突破24亿件，按年增50%，是日常处理量的2.2倍左右。"
},
{
"title": "走进电信诈骗：入行五天就被抓",
"href": "http://m.cnbeta.com/view/557679.htm",
"summary": "摘要：在电话那边冒充警察、检察官、法官的骗子到底是些什么人？他们为何会走上电信诈骗犯罪之路？在打电话的过程中，他们是怎样引诱受害者一步一步进入圈套的？他们又如何看待自己的犯罪行为？近日，广州日报记者走进广东省阳江监狱，与高墙内的骗子面对面交谈，通过骗子的自白揭开电信诈骗犯罪背后的故事。"
},
{
"title": "“双11”繁华背后:增量的代价",
"href": "http://m.cnbeta.com/view/557677.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/8987f95881e0b1f.jpg",
"summary": "摘要：不出意料，今年“双11”电商大佬们再度刷新销售纪录。但在热闹的大战背后，沉下心来思考，从电商平台到中小卖家，再到快递物流和广大消费者，是否真的因此而获得实际商业意义上的价值增量？北京商报记者在调查中发现，一日高销量的代价，是用户前期持币的淡季与后期减少购物换来的；快递企业增加临时工的投入，爆仓和大量退货也对交通造成压力，快递员可能并未多增加多少实际收入……这些朴素而纠结的商业百态，露出了“双11”背后的一角冰山。"
},
{
"title": "iPhone 6s自动关机故障曝电池短板",
"href": "http://m.cnbeta.com/view/557675.htm",
"summary": "摘要：近期有关iPhone自动关机的情况引发网友热议，大量用户在微博、微信平台表示遭遇类似情况。北京商报记者11月13日致电苹果官方维修点，其工作人员表示目前主要受影响机型是iPhone  6S和iPhone  6s  Plus，其他机型目前并没发现大量案例。至于问题原因，目前并没有确切消息。伴随天气转冷，苹果手机也开始出现大量问题。众多网友反映，这段时间自己的苹果手机在电量还剩余20%左右时出现自动关机情况。"
},
{
"title": "“双11”互联网金融机构凑热闹花样繁多 冲动投资会剁手",
"href": "http://m.cnbeta.com/view/557673.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/d0614ff7a62bb88.png_600x600.png",
"summary": "摘要：今年“双11”，网络购物再创新的成交纪录。《投资者报》记者了解到，与消费场景不同的是，互联网金融机构也在这期间纷纷发力，吸引更多的投资者参与。今年的“双11”理财，加息、现金红包、礼品兑换、送iPhone7等活动花样翻新，让投资者在“双11”当天“剁手”的前后，准备好“补血”的资金。"
},
{
"title": "[多图]超级月亮背后的科学",
"href": "http://m.cnbeta.com/view/557671.htm",
"img": "http://static.cnbetacdn.com/article/2016/1114/75237892b74d3c7.jpg",
"summary": "摘要：当你在2016年11月14日抬头仰望月亮时，不仅看到的是满月，而且在当天，月球绕地球轨道将运行至近地点，你会观测到极其罕见的超级月亮，通常的超级月亮英文称之为Supermoon，这次NASA有称呼为Extra-super  Moon，这是自1948年以来距离地球最近的满月，下一次我们要看到这样的超级月亮需到2034年。"
},
{
"title": "“卖自家欠款”能否实现乐视金融梦？",
"href": "http://m.cnbeta.com/view/557669.htm",
"img": "http://static.cnbetacdn.com/thumb/article/2016/1114/899c99dac2756f1.png_600x600.png",
"summary": "摘要：乐视金融一直是贾跃亭“乐视生态”中最为低调的一个板块，直到最近才被他摆到显眼的位置上来。那么，乐视金融如何实现它的定位：立足于乐视，又不局限于乐视，并反哺于乐视?进入今年三季度后，乐视金融的理财业务开始明显提速。截至目前，乐视金融官方平台上已有超过100款理财产品发布。《第一财经日报》梳理公开资料发现，在发布频率快、年化收益高的理财产品背后，原始债权人中频现乐视供应商的身影;部分企业还拥有高额的乐视欠款，并已计提坏账准备。此外，有代销平台公布的产品信息还显示，多款保理产品的底层资产即为乐视供应商的应收账款。"
}
]

module.exports = {
  res: res
}
